CSI API ETABS v1

# cDesignSteelIndian_IS_800_2007 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDStIndian_IS_800_2007 Indian_IS_800_2007 { get; }

    ReadOnly Property Indian_IS_800_2007 As cDStIndian_IS_800_2007
    	Get

    Dim instance As cDesignSteel
    Dim value As cDStIndian_IS_800_2007

    value = instance.Indian_IS_800_2007

    property cDStIndian_IS_800_2007^ Indian_IS_800_2007 {
    	cDStIndian_IS_800_2007^ get ();
    }

    abstract Indian_IS_800_2007 : cDStIndian_IS_800_2007 with get

#### Property Value

Type: cDStIndian_IS_800_2007

See Also

#### Reference

cDesignSteel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com